//IBMUSERD JOB CLASS=A,MSGCLASS=H,NOTIFY=NLOPEZ,MSGLEVEL=(1,1)
//*
//* Sample jcl to run batch DATBATCH
//*
//DBUG    EXEC PGM=DATBATCH,PARM='/TEST(ALL,,,RDS:*)'
//*STEPLIB  DD  DISP=SHR,DSN=ZDEV.MAIN.LOAD
//STEPLIB  DD  DISP=SHR,DSN=IBMUSER.VSCODE6.LOAD   
//*         DD  DISP=SHR,DSN=IDZ.V16R0M0.SEQAMOD    
//SYSPRINT DD SYSOUT=*
//SYSOUT   DD SYSOUT=*


