//NLOPEZA  JOB CLASS=A,MSGCLASS=H,NOTIFY=IBMUSER
//ASM       EXEC PGM=ASMA90,PARM='OBJECT'
//SYSPRINT  DD   SYSOUT=*
//SYSLIN    DD   DSNAME=&&OBJSET,UNIT=SYSDA,SPACE=(TRK,(5,5)),
//             DISP=(MOD,PASS)
//SYSIN     DD   DSN=ZDEV.DEVELOP.ASM(DATWTO),DISP=SHR
//SYSLIB    DD   DSN=SYS1.MACLIB,DISP=SHR
//          DD   DSN=ZDEV.DEVELOP.MACLIB,DISP=SHR
//*
//*
//LINK      EXEC PGM=IEWL,PARM='LIST,MAP,XREF'
//SYSPRINT  DD   SYSOUT=*
//SYSUT1    DD   UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSLMOD   DD   DSN=ZDEV.DEVELOP.LOAD(DATWTO),DISP=SHR
//SYSLIN    DD   DSN=&&OBJSET,DISP=(OLD,DELETE)
//*
//*
//GO  EXEC PGM=DATWTO
//STEPLIB  DD  DISP=SHR,DSN=ZDEV.MAIN.LOAD   UCD LOADLIB