//NLOPEZWT JOB CLASS=A,MSGCLASS=H,NOTIFY=NLOPEZ
//S EXEC PGM=DATWTO  TEST PUSH 
//* see system console for wto
//STEPLIB  DD  DISP=SHR,DSN=ZDEV.MAIN.LOAD   UCD Loadlib
//*STEPLIB  DD  DISP=SHR,DSN=IBMUSER.VSCODE.LOAD user build in vsc